In [5]:
import pandas as pd
import numpy as np

In [16]:
labels = ['a', 'b', 'c']
lista = [10,20,30]
arr = np.array([10,20,30])
d = {'a':10, 'b':20, 'c':30}

In [18]:
pd.Series(data=lista, index=labels)

a    10
b    20
c    30
dtype: int64

SyntaxError: invalid syntax (<ipython-input-6-bc888235687a>, line 1)

In [20]:
pd.Series(lista, arr)

10    10
20    20
30    30
dtype: int64

In [33]:
ser = pd.Series(['eua', 'china', 'england', 'france'], index=[1,2,3,4])

In [34]:
ser

1        eua
2      china
3    england
4     france
dtype: object

In [36]:
ser[1]

'eua'

In [4]:
np.random.seed(101)
randomf = np.random

In [27]:
df = pd.DataFrame(randomf.randn(5,4), index='a b c d e'.split(), columns='w x y z'.split())

In [6]:
df

          w         y         x         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [11]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [13]:
df[['w', 'x']]

          w         x
a  2.706850  0.907969
b  0.651118 -0.848077
c -2.018168  0.528813
d  0.188695 -0.933237
e  0.190794  2.605967

In [14]:
df['new'] = df['w'] + df['z']

In [15]:
df

          w         y         x         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [17]:
df.drop('new', axis=1, inplace=True)

In [18]:
df

          w         y         x         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [22]:
df.loc['a']

w    2.706850
y    0.628133
x    0.907969
z    0.503826
Name: a, dtype: float64

In [26]:
df.loc[['a', 'b'],['x', 'z']]

          x         z
a  0.907969  0.503826
b -0.848077  0.605965

In [25]:
df.iloc[:2, 2:]

          x         z
a  0.907969  0.503826
b -0.848077  0.605965

In [28]:
df

          w         x         y         z
a  0.302665  1.693723 -1.706086 -1.159119
b -0.134841  0.390528  0.166905  0.184502
c  0.807706  0.072960  0.638787  0.329646
d -0.497104 -0.754070 -0.943406  0.484752
e -0.116773  1.901755  0.238127  1.996652

In [29]:
df>0

       w      x      y      z
a   True   True  False  False
b  False   True   True   True
c   True   True   True   True
d  False  False  False   True
e  False   True   True   True

In [31]:
df[df['w']>0]['y']

a   -1.706086
c    0.638787
Name: y, dtype: float64

In [35]:
df[(df['w']>0) & (df['y']>0.1)]

          w        x         y         z
c  0.807706  0.07296  0.638787  0.329646

In [41]:
col = 'pa am rr ap ac'.split()
df['state'] = col
df

  index         w         x         y         z state
0     a  0.302665  1.693723 -1.706086 -1.159119    pa
1     b -0.134841  0.390528  0.166905  0.184502    am
2     c  0.807706  0.072960  0.638787  0.329646    rr
3     d -0.497104 -0.754070 -0.943406  0.484752    ap
4     e -0.116773  1.901755  0.238127  1.996652    ac

In [42]:
df.reset_index(inplace=True)

In [43]:
df

   level_0 index         w         x         y         z state
0        0     a  0.302665  1.693723 -1.706086 -1.159119    pa
1        1     b -0.134841  0.390528  0.166905  0.184502    am
2        2     c  0.807706  0.072960  0.638787  0.329646    rr
3        3     d -0.497104 -0.754070 -0.943406  0.484752    ap
4        4     e -0.116773  1.901755  0.238127  1.996652    ac

In [44]:
df.set_index('state', inplace=True)

In [45]:
df

       level_0 index         w         x         y         z
state
pa           0     a  0.302665  1.693723 -1.706086 -1.159119
am           1     b -0.134841  0.390528  0.166905  0.184502
rr           2     c  0.807706  0.072960  0.638787  0.329646
ap           3     d -0.497104 -0.754070 -0.943406  0.484752
ac           4     e -0.116773  1.901755  0.238127  1.996652

In [48]:
df.drop('index', axis=1, inplace=True)

In [49]:
fd

NameError: name 'fd' is not defined

In [50]:
df

              w         x         y         z
state
pa     0.302665  1.693723 -1.706086 -1.159119
am    -0.134841  0.390528  0.166905  0.184502
rr     0.807706  0.072960  0.638787  0.329646
ap    -0.497104 -0.754070 -0.943406  0.484752
ac    -0.116773  1.901755  0.238127  1.996652

indice e multiniveis

In [56]:
# Níveis de Índice
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [52]:
outside
inside

[1, 2, 3, 1, 2, 3]

In [54]:
hier_index = list(zip(outside,inside))

In [57]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [58]:
df = pd.DataFrame(np.random.randn(6,2), index=hier_index)

In [59]:
df

             0         1
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [60]:
df.index.names = ['Grupo', 'Numero']

In [61]:
df

                     0         1
Grupo Numero
G1    1      -0.993263  0.196800
      2      -1.136645  0.000366
      3       1.025984 -0.156598
G2    1      -0.031579  0.649826
      2       2.154846 -0.610259
      3      -0.755325 -0.346419

In [68]:
df.loc['G2'][1]

Numero
1    0.649826
2   -0.610259
3   -0.346419
Name: 1, dtype: float64

In [69]:
df.xs('G1')

               0         1
Numero
1      -0.993263  0.196800
2      -1.136645  0.000366
3       1.025984 -0.156598

In [72]:
df.xs(2, level='Numero')

              0         1
Grupo
G1    -1.136645  0.000366
G2     2.154846 -0.610259

dados ausentes

In [73]:
d={'a':[1, 2, np.nan], 'b':[5, np.nan, np.nan], 'c':[1,2,3]}

In [74]:
df = pd.DataFrame(d)

In [75]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [81]:
df.dropna(thresh=1)

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [89]:
df['a'].fillna(value=df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [86]:
df

     a    b  c
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [3]:
data = {'Empresa':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Nome':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Venda':[200,120,340,124,243,350]}

In [91]:
data

{'Empresa': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Nome': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Venda': [200, 120, 340, 124, 243, 350]}

In [4]:
data = pd.DataFrame(data)

NameError: name 'pd' is not defined

In [93]:
data

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [94]:
g = data.groupby('Empresa')

In [95]:
g.sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [96]:
g.mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [97]:
g.describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [104]:
g.sum().loc['FB']

Venda    593
Name: FB, dtype: int64

In [ ]:
g2 = data.groupby('Nome')

In [ ]:
g2.sum().loc['Amy']

concatenar, mesclar, juntar

In [7]:
import pandas as pd

In [8]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [9]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [10]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [11]:
df1, df2, df3

(    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11)

In [12]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [15]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [16]:
esquerda = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
direita = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [17]:
esquerda

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [18]:
direita

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [19]:
pd.merge(esquerda, direita, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [20]:
pd.merge(esquerda, direita, on=['key1', 'key2'])

KeyError: 'key1'

In [21]:
esquerda = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

direita = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [24]:
esquerda

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [23]:
direita

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [25]:
esquerda.join(direita)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [26]:
direita.join(esquerda)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [29]:
esquerda.join(direita, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

operações

In [30]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [31]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [32]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [33]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [34]:
import numpy as np

In [35]:
np.unique(df['col2'])

array([444, 555, 666], dtype=int64)

In [36]:
df['col2'].nunique()

3

In [37]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [40]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [41]:
df['col1'].apply(lambda x:x**2)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [42]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [43]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [45]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [46]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [47]:
data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 2, 5, 4, 1]}

In [48]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [49]:
df.pivot_table(values='D', index=['A', 'B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

-------------------------
entrada e saida de dados

In [51]:
import numpy as np
import pandas as pd

In [54]:
df = pd.read_csv('exemplo')

In [55]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [56]:
df + 1

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [57]:
df.to_csv('exemplo.csv', sep=';', decimal=',')

In [58]:
df = pd.read_excel('Exemplo_Excel.xlsx', sheetname='Sheet1')

C:\Users\Lennon\Anaconda3\lib\site-packages\pandas\io\excel.py:329: FutureWarning: The `sheetname` keyword is deprecated, use `sheet_name` instead
  **kwds)

In [59]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [62]:
df = pd.read_html('http://ru.ufpa.br/index.php?option=com_content&view=article&id=7')

In [63]:
df

[                                                    0  \
 0                                                 NaN
 1   2019 RESTAURANTE UNIVERSITÁRIO Almoço de 11:30...
 2                                                 DIA
 3                                 SEGUNDA-FEIRA 28-01
 4                                   TERÇA-FEIRA 29-01
 5                                  QUARTA-FEIRA 30-01
 6                                  QUINTA-FEIRA 31-01
 7                                   SEXTA-FEIRA 01-02
 8                                                 NaN
 9   CARDÁPIO DO DIA (cardápio sujeito a alterações...
 10     JANTAR -  17:45 - 19:15 -  CARDÁPIO VEGANO - -

                                                     1  \
 0                                                 NaN
 1                                                 NaN
 2                                              ALMOÇO
 3   PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...
 4   RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...
 5   ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...
 6   FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...
 7   PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...
 8                                                 NaN
 9                                                 NaN
 10                                                NaN

                                                     2
 0                                                 NaN
 1                                                 NaN
 2                                              JANTAR
 3   ----------------------------------------------...
 4                                                 NaN
 5                                                 NaN
 6                                                 NaN
 7                                                 NaN
 8                                                 NaN
 9                                                 NaN
 10                                                NaN  ,           0
 0  Cardápio,                                                    0  \
 0                                                NaN
 1  2019 RESTAURANTE UNIVERSITÁRIO Almoço de 11:30...
 2                                                DIA
 3                                SEGUNDA-FEIRA 28-01
 4                                  TERÇA-FEIRA 29-01
 5                                 QUARTA-FEIRA 30-01
 6                                 QUINTA-FEIRA 31-01
 7                                  SEXTA-FEIRA 01-02
 8                                                NaN

                                                    1  \
 0                                                NaN
 1                                                NaN
 2                                             ALMOÇO
 3  PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...
 4  RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...
 5  ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...
 6  FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...
 7  PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...
 8                                                NaN

                                                    2
 0                                                NaN
 1                                                NaN
 2                                             JANTAR
 3  ----------------------------------------------...
 4                                                NaN
 5                                                NaN
 6                                                NaN
 7                                                NaN
 8                                                NaN  ,                                                    0
 0  2019 RESTAURANTE UNIVERSITÁRIO Almoço de 11:30...,                      0                                                  1  \
 0                  DIA                                             ALMOÇO
 1  SEGUNDA-FEIRA 28-01  PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...
 2    TERÇA-FEIRA 29-01  RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...
 3   QUARTA-FEIRA 30-01  ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...
 4   QUINTA-FEIRA 31-01  FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...
 5    SEXTA-FEIRA 01-02  PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...
 6                  NaN                                                NaN

                                                    2
 0                                             JANTAR
 1  ----------------------------------------------...
 2                                                NaN
 3                                                NaN
 4                                                NaN
 5                                                NaN
 6                                                NaN  ,                                                    0
 0  CARDÁPIO DO DIA (cardápio sujeito a alterações...
 1     JANTAR -  17:45 - 19:15 -  CARDÁPIO VEGANO - -]

In [69]:
len(df)

6

In [70]:
df[0]

,0,1,2
0,NaN,NaN,NaN
1,2019 RESTAURANTE UNIVERSITÁRIO Almoço de 11:30...,NaN,NaN
2,DIA,ALMOÇO,JANTAR
3,SEGUNDA-FEIRA 28-01,PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...,----------------------------------------------...
4,TERÇA-FEIRA 29-01,RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...,NaN
5,QUARTA-FEIRA 30-01,ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...,NaN
6,QUINTA-FEIRA 31-01,FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...,NaN
7,SEXTA-FEIRA 01-02,PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...,NaN
8,NaN,NaN,NaN
9,CARDÁPIO DO DIA (cardápio sujeito a alterações...,NaN,NaN
10,JANTAR - 17:45 - 19:15 - CARDÁPIO VEGANO - -,NaN,NaN

In [71]:
df[1]

          0
0  Cardápio

In [80]:
df[2]

,0,1,2
0,NaN,NaN,NaN
1,2019 RESTAURANTE UNIVERSITÁRIO Almoço de 11:30...,NaN,NaN
2,DIA,ALMOÇO,JANTAR
3,SEGUNDA-FEIRA 28-01,PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...,----------------------------------------------...
4,TERÇA-FEIRA 29-01,RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...,NaN
5,QUARTA-FEIRA 30-01,ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...,NaN
6,QUINTA-FEIRA 31-01,FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...,NaN
7,SEXTA-FEIRA 01-02,PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...,NaN
8,NaN,NaN,NaN

In [73]:
df[3]

                                                   0
0  2019 RESTAURANTE UNIVERSITÁRIO Almoço de 11:30...

In [74]:
df[4]

,0,1,2
0,DIA,ALMOÇO,JANTAR
1,SEGUNDA-FEIRA 28-01,PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...,----------------------------------------------...
2,TERÇA-FEIRA 29-01,RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...,NaN
3,QUARTA-FEIRA 30-01,ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...,NaN
4,QUINTA-FEIRA 31-01,FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...,NaN
5,SEXTA-FEIRA 01-02,PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...,NaN
6,NaN,NaN,NaN

In [75]:
df[5]

                                                   0
0  CARDÁPIO DO DIA (cardápio sujeito a alterações...
1     JANTAR -  17:45 - 19:15 -  CARDÁPIO VEGANO - -

In [76]:
df[6]

IndexError: list index out of range

In [81]:
ru_cardapio = df[4]

In [82]:
ru_cardapio

,0,1,2
0,DIA,ALMOÇO,JANTAR
1,SEGUNDA-FEIRA 28-01,PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...,----------------------------------------------...
2,TERÇA-FEIRA 29-01,RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...,NaN
3,QUARTA-FEIRA 30-01,ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...,NaN
4,QUINTA-FEIRA 31-01,FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...,NaN
5,SEXTA-FEIRA 01-02,PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...,NaN
6,NaN,NaN,NaN

In [98]:
ru_cardapio.fillna(value='SEM JANTA',inplace=True)

In [108]:
ru_cardapio

,0,1,2
0,DIA,ALMOÇO,JANTAR
1,SEGUNDA-FEIRA 28-01,PERNIL AO MOLHO VEGETARIANO: JARDINEIRA DE SOJ...,SEM JANTA
2,TERÇA-FEIRA 29-01,RISOTO DE FRANGO VEGETARIANO: RISOTO VEGETARIA...,SEM JANTA
3,QUARTA-FEIRA 30-01,ALMÔNDEGAS AO MOLHO VEGETARIANO: REFOGADO DE L...,SEM JANTA
4,QUINTA-FEIRA 31-01,FRANGO AO MOLHO VEGETARIANO:QUINOA A JARDINEIR...,SEM JANTA
5,SEXTA-FEIRA 01-02,PICADINHO A JARDINEIRA VEGETARIANO: PICADINHO ...,SEM JANTA
6,SEM JANTA,SEM JANTA,SEM JANTA

In [107]:
ru_cardapio[2][1] = 'SEM JANTA'